const todayNews = [
    {
        title: "افتتاح مجمع الأصيل التجاري",
        date: "2023-10-01",
        content: "تم افتتاح مجمع الأصيل التجاري الجديد في قلب المدينة، ويضم مجموعة متنوعة من المتاجر والمطاعم.",
        image: "images/opening.jpg"
    },
    {
        title: "عروض خاصة في مجمع الأصيل",
        date: "2023-10-05",
        content: "استمتع بعروض خاصة في مجمع الأصيل التجاري خلال هذا الشهر، تشمل خصومات تصل إلى 50% على مجموعة من المتاجر.",
        image: "images/special-offers.jpg"
    },
    {
        title: "مهرجان التسوق السنوي",
        date: "2023-10-10",
        content: "انضم إلينا في مهرجان التسوق السنوي في مجمع الأصيل التجاري، حيث يمكنك الاستمتاع بالفعاليات الترفيهية والعروض الحصرية.",
        image: "images/shopping-festival.jpg"
    },
    {
        title: "افتتاح مطعم جديد",
        date: "2023-10-15",
        content: "يسرنا الإعلان عن افتتاح مطعم جديد يقدم أشهى الأطباق المحلية والعالمية في مجمع الأصيل التجاري.",
        image: "images/new-restaurant.jpg"
    },
    {
        title: "تحديثات جديدة على الموقع",
        date: "2025-07-10",
        content: "قمنا بتحديث موقعنا الإلكتروني ليصبح أكثر سهولة في الاستخدام، مع تصميم جديد وميزات محسنة.",
        image: "images/website-update.jpg"
    }];